Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/atdf/PIC32MZ2064DAB288.atdf
         <register caption="DMA Channel x Pattern Data Register" name="DCH1DAT" offset="0x1d0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="CHPDAT" />
         </register>
         <register caption="DMA Channel x Pattern Data Register" name="DCH2DAT" offset="0x290" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="CHPDAT" />
         </register>
         <register caption="DMA Channel x Pattern Data Register" name="DCH3DAT" offset="0x350" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="CHPDAT" />
         </register>
         <register caption="DMA Channel x Pattern Data Register" name="DCH4DAT" offset="0x410" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="CHPDAT" />
         </register>
         <register caption="DMA Channel x Pattern Data Register" name="DCH5DAT" offset="0x4d0" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="CHPDAT" />
         </register>
         <register caption="DMA Channel x Pattern Data Register" name="DCH6DAT" offset="0x590" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="CHPDAT" />
         </register>
         <register caption="DMA Channel x Pattern Data Register" name="DCH7DAT" offset="0x650" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="CHPDAT" />
         </register>
      </register-group>
      <value-group caption="DMA Module Busy bit" name="DMACON__DMABUSY">
         <value caption="DMA module is active and is transferring data" name="" value="0x1" />
         <value caption="DMA module is disabled and not actively transferring data" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Suspend bit" name="DMACON__SUSPEND">
         <value caption="DMA transfers are suspended to allow CPU uninterrupted access to data bus" name="" value="0x1" />
         <value caption="DMA operates normally" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA On bit" name="DMACON__ON">
         <value caption="DMA module is enabled" name="" value="0x0" />
         <value caption="DMA module is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Read/Write Status bit" name="DMASTAT__RDWR">
         <value caption="Last DMA bus access when an error was detected was a read" name="" value="0x1" />
         <value caption="Last DMA bus access when an error was detected was a write" name="" value="0x0" />
      </value-group>
      <value-group caption="CRC Channel Select bits" name="DCRCCON__CRCCH">
         <value caption="CRC is assigned to Channel 7" name="" value="0x7" />
         <value caption="CRC is assigned to Channel 6" name="" value="0x6" />
         <value caption="CRC is assigned to Channel 5" name="" value="0x5" />
         <value caption="CRC is assigned to Channel 4" name="" value="0x4" />
         <value caption="CRC is assigned to Channel 3" name="" value="0x3" />
         <value caption="CRC is assigned to Channel 2" name="" value="0x2" />
         <value caption="CRC is assigned to Channel 1" name="" value="0x1" />
         <value caption="CRC is assigned to Channel 0" name="" value="0x0" />
      </value-group>
      <value-group caption="CRC Type Selection bit" name="DCRCCON__CRCTYP">
         <value caption="The CRC module will calculate an IP header checksum" name="" value="0x1" />
         <value caption="The CRC module will calculate a LFSR CRC" name="" value="0x0" />
      </value-group>
      <value-group caption="CRC Append Mode bit" name="DCRCCON__CRCAPP">
         <value caption="The DMA transfers data from the source into the CRC but NOT to the destination. When a block transfer completes the DMA writes the calculated CRC value to the location given by CHxDSA" name="" value="0x1" />
         <value caption="The DMA transfers data from the source through the CRC obeying WBO as it writes the data to the destination" name="" value="0x0" />
      </value-group>
      <value-group caption="CRC Enable bit" name="DCRCCON__CRCEN">
         <value caption="CRC module is enabled and channel transfers are routed through the CRC module" name="" value="0x1" />
         <value caption="CRC module is disabled and channel transfers proceed normally" name="" value="0x0" />
      </value-group>
      <value-group caption="Polynomial Length bits" name="DCRCCON__PLEN">
         <value caption="1 (CRC module is in IP Header mode)These bits are unused." name="" />
         <value caption="0 (CRC module is in LFSR mode) Denotes the length of the polynomial minus 1." name="" />
      </value-group>
      <value-group caption="CRC Bit Order Selection bit" name="DCRCCON__BITO">
         <value caption="(When CRCTYP (ie" name="" value="0x1" />
         <value caption="(When CRCTYP (i.e." name="" value="0x0" />
      </value-group>
      <value-group caption="CRC Write Byte Order Selection bit" name="DCRCCON__WBO">
         <value caption="Source data is written to the destination re-ordered as defined by BYTO" name="" value="0x1" />
         <value caption="Source data is written to the destination unaltered" name="" value="0x0" />
      </value-group>
      <value-group caption="CRC Byte Order Selection bits" name="DCRCCON__BYTO">
         <value caption="Endian byte swap on half-word boundaries (i.e." name="" value="0x3" />
         <value caption="Swap half-words on word boundaries (i.e." name="" value="0x2" />
         <value caption="Endian byte swap on word boundaries (i.e." name="" value="0x1" />
         <value caption="No swapping (i.e." name="" value="0x0" />
      </value-group>
      <value-group caption="CRC Data Register bits" name="DCRCDATA__DCRCDATA">
         <value caption="1 (CRC module is in IP Header mode) Only the lower 16 bits contain IP header checksum information. The upper 16 bits are always 0. Data written to this register is converted and read back in 1s complement form" name="" />
         <value caption="0 (CRC module is in LFSR mode) Bits greater than PLEN will return 0 on any read." name="" />
      </value-group>
