Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/atdf/PIC32MZ2064DAB288.atdf
         <register caption="" name="GLCDCURDATA5" offset="0x814" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL115" />
            <bitfield mask="0x000000F0" name="PIXEL114" />
            <bitfield mask="0x00000F00" name="PIXEL113" />
            <bitfield mask="0x0000F000" name="PIXEL112" />
            <bitfield mask="0x000F0000" name="PIXEL111" />
            <bitfield mask="0x00F00000" name="PIXEL110" />
            <bitfield mask="0x0F000000" name="PIXEL19" />
            <bitfield mask="0xF0000000" name="PIXEL18" />
         </register>
         <register caption="" name="GLCDCURDATA6" offset="0x818" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL123" />
            <bitfield mask="0x000000F0" name="PIXEL122" />
            <bitfield mask="0x00000F00" name="PIXEL121" />
            <bitfield mask="0x0000F000" name="PIXEL120" />
            <bitfield mask="0x000F0000" name="PIXEL119" />
            <bitfield mask="0x00F00000" name="PIXEL118" />
            <bitfield mask="0x0F000000" name="PIXEL117" />
            <bitfield mask="0xF0000000" name="PIXEL116" />
         </register>
         <register caption="" name="GLCDCURDATA7" offset="0x81C" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL131" />
            <bitfield mask="0x000000F0" name="PIXEL130" />
            <bitfield mask="0x00000F00" name="PIXEL129" />
            <bitfield mask="0x0000F000" name="PIXEL128" />
            <bitfield mask="0x000F0000" name="PIXEL127" />
            <bitfield mask="0x00F00000" name="PIXEL126" />
            <bitfield mask="0x0F000000" name="PIXEL125" />
            <bitfield mask="0xF0000000" name="PIXEL124" />
         </register>
         <register caption="" name="GLCDCURDATA8" offset="0x820" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL27" />
            <bitfield mask="0x000000F0" name="PIXEL26" />
            <bitfield mask="0x00000F00" name="PIXEL25" />
            <bitfield mask="0x0000F000" name="PIXEL24" />
            <bitfield mask="0x000F0000" name="PIXEL23" />
            <bitfield mask="0x00F00000" name="PIXEL22" />
            <bitfield mask="0x0F000000" name="PIXEL21" />
            <bitfield mask="0xF0000000" name="PIXEL20" />
         </register>
         <register caption="" name="GLCDCURDATA9" offset="0x824" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL215" />
            <bitfield mask="0x000000F0" name="PIXEL214" />
            <bitfield mask="0x00000F00" name="PIXEL213" />
            <bitfield mask="0x0000F000" name="PIXEL212" />
            <bitfield mask="0x000F0000" name="PIXEL211" />
            <bitfield mask="0x00F00000" name="PIXEL210" />
            <bitfield mask="0x0F000000" name="PIXEL29" />
            <bitfield mask="0xF0000000" name="PIXEL28" />
         </register>
         <register caption="" name="GLCDCURDATA10" offset="0x828" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL223" />
            <bitfield mask="0x000000F0" name="PIXEL222" />
            <bitfield mask="0x00000F00" name="PIXEL221" />
            <bitfield mask="0x0000F000" name="PIXEL220" />
            <bitfield mask="0x000F0000" name="PIXEL219" />
            <bitfield mask="0x00F00000" name="PIXEL218" />
            <bitfield mask="0x0F000000" name="PIXEL217" />
            <bitfield mask="0xF0000000" name="PIXEL216" />
         </register>
         <register caption="" name="GLCDCURDATA11" offset="0x82C" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL231" />
            <bitfield mask="0x000000F0" name="PIXEL230" />
            <bitfield mask="0x00000F00" name="PIXEL229" />
            <bitfield mask="0x0000F000" name="PIXEL228" />
            <bitfield mask="0x000F0000" name="PIXEL227" />
            <bitfield mask="0x00F00000" name="PIXEL226" />
            <bitfield mask="0x0F000000" name="PIXEL225" />
            <bitfield mask="0xF0000000" name="PIXEL224" />
         </register>
         <register caption="" name="GLCDCURDATA12" offset="0x830" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL37" />
            <bitfield mask="0x000000F0" name="PIXEL36" />
            <bitfield mask="0x00000F00" name="PIXEL35" />
            <bitfield mask="0x0000F000" name="PIXEL34" />
            <bitfield mask="0x000F0000" name="PIXEL33" />
            <bitfield mask="0x00F00000" name="PIXEL32" />
            <bitfield mask="0x0F000000" name="PIXEL31" />
            <bitfield mask="0xF0000000" name="PIXEL30" />
         </register>
         <register caption="" name="GLCDCURDATA13" offset="0x834" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL315" />
            <bitfield mask="0x000000F0" name="PIXEL314" />
            <bitfield mask="0x00000F00" name="PIXEL313" />
            <bitfield mask="0x0000F000" name="PIXEL312" />
            <bitfield mask="0x000F0000" name="PIXEL311" />
            <bitfield mask="0x00F00000" name="PIXEL310" />
            <bitfield mask="0x0F000000" name="PIXEL39" />
            <bitfield mask="0xF0000000" name="PIXEL38" />
         </register>
         <register caption="" name="GLCDCURDATA14" offset="0x838" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL323" />
            <bitfield mask="0x000000F0" name="PIXEL322" />
            <bitfield mask="0x00000F00" name="PIXEL321" />
            <bitfield mask="0x0000F000" name="PIXEL320" />
            <bitfield mask="0x000F0000" name="PIXEL319" />
            <bitfield mask="0x00F00000" name="PIXEL318" />
            <bitfield mask="0x0F000000" name="PIXEL317" />
            <bitfield mask="0xF0000000" name="PIXEL316" />
         </register>
         <register caption="" name="GLCDCURDATA15" offset="0x83C" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL331" />
            <bitfield mask="0x000000F0" name="PIXEL330" />
            <bitfield mask="0x00000F00" name="PIXEL329" />
            <bitfield mask="0x0000F000" name="PIXEL328" />
            <bitfield mask="0x000F0000" name="PIXEL327" />
            <bitfield mask="0x00F00000" name="PIXEL326" />
            <bitfield mask="0x0F000000" name="PIXEL325" />
            <bitfield mask="0xF0000000" name="PIXEL324" />
         </register>
         <register caption="" name="GLCDCURDATA16" offset="0x840" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL47" />
            <bitfield mask="0x000000F0" name="PIXEL46" />
            <bitfield mask="0x00000F00" name="PIXEL45" />
            <bitfield mask="0x0000F000" name="PIXEL44" />
            <bitfield mask="0x000F0000" name="PIXEL43" />
            <bitfield mask="0x00F00000" name="PIXEL42" />
            <bitfield mask="0x0F000000" name="PIXEL41" />
            <bitfield mask="0xF0000000" name="PIXEL40" />
         </register>
