Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/atdf/PIC32MZ2064DAB288.atdf
         <register caption="" name="GLCDCURDATA85" offset="0x954" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL2115" />
            <bitfield mask="0x000000F0" name="PIXEL2114" />
            <bitfield mask="0x00000F00" name="PIXEL2113" />
            <bitfield mask="0x0000F000" name="PIXEL2112" />
            <bitfield mask="0x000F0000" name="PIXEL2111" />
            <bitfield mask="0x00F00000" name="PIXEL2110" />
            <bitfield mask="0x0F000000" name="PIXEL219" />
            <bitfield mask="0xF0000000" name="PIXEL218" />
         </register>
         <register caption="" name="GLCDCURDATA86" offset="0x958" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL2123" />
            <bitfield mask="0x000000F0" name="PIXEL2122" />
            <bitfield mask="0x00000F00" name="PIXEL2121" />
            <bitfield mask="0x0000F000" name="PIXEL2120" />
            <bitfield mask="0x000F0000" name="PIXEL2119" />
            <bitfield mask="0x00F00000" name="PIXEL2118" />
            <bitfield mask="0x0F000000" name="PIXEL2117" />
            <bitfield mask="0xF0000000" name="PIXEL2116" />
         </register>
         <register caption="" name="GLCDCURDATA87" offset="0x95C" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL2131" />
            <bitfield mask="0x000000F0" name="PIXEL2130" />
            <bitfield mask="0x00000F00" name="PIXEL2129" />
            <bitfield mask="0x0000F000" name="PIXEL2128" />
            <bitfield mask="0x000F0000" name="PIXEL2127" />
            <bitfield mask="0x00F00000" name="PIXEL2126" />
            <bitfield mask="0x0F000000" name="PIXEL2125" />
            <bitfield mask="0xF0000000" name="PIXEL2124" />
         </register>
         <register caption="" name="GLCDCURDATA88" offset="0x960" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL227" />
            <bitfield mask="0x000000F0" name="PIXEL226" />
            <bitfield mask="0x00000F00" name="PIXEL225" />
            <bitfield mask="0x0000F000" name="PIXEL224" />
            <bitfield mask="0x000F0000" name="PIXEL223" />
            <bitfield mask="0x00F00000" name="PIXEL222" />
            <bitfield mask="0x0F000000" name="PIXEL221" />
            <bitfield mask="0xF0000000" name="PIXEL220" />
         </register>
         <register caption="" name="GLCDCURDATA89" offset="0x964" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL2215" />
            <bitfield mask="0x000000F0" name="PIXEL2214" />
            <bitfield mask="0x00000F00" name="PIXEL2213" />
            <bitfield mask="0x0000F000" name="PIXEL2212" />
            <bitfield mask="0x000F0000" name="PIXEL2211" />
            <bitfield mask="0x00F00000" name="PIXEL2210" />
            <bitfield mask="0x0F000000" name="PIXEL229" />
            <bitfield mask="0xF0000000" name="PIXEL228" />
         </register>
         <register caption="" name="GLCDCURDATA90" offset="0x968" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL2223" />
            <bitfield mask="0x000000F0" name="PIXEL2222" />
            <bitfield mask="0x00000F00" name="PIXEL2221" />
            <bitfield mask="0x0000F000" name="PIXEL2220" />
            <bitfield mask="0x000F0000" name="PIXEL2219" />
            <bitfield mask="0x00F00000" name="PIXEL2218" />
            <bitfield mask="0x0F000000" name="PIXEL2217" />
            <bitfield mask="0xF0000000" name="PIXEL2216" />
         </register>
         <register caption="" name="GLCDCURDATA91" offset="0x96C" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL2231" />
            <bitfield mask="0x000000F0" name="PIXEL2230" />
            <bitfield mask="0x00000F00" name="PIXEL2229" />
            <bitfield mask="0x0000F000" name="PIXEL2228" />
            <bitfield mask="0x000F0000" name="PIXEL2227" />
            <bitfield mask="0x00F00000" name="PIXEL2226" />
            <bitfield mask="0x0F000000" name="PIXEL2225" />
            <bitfield mask="0xF0000000" name="PIXEL2224" />
         </register>
         <register caption="" name="GLCDCURDATA92" offset="0x970" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL237" />
            <bitfield mask="0x000000F0" name="PIXEL236" />
            <bitfield mask="0x00000F00" name="PIXEL235" />
            <bitfield mask="0x0000F000" name="PIXEL234" />
            <bitfield mask="0x000F0000" name="PIXEL233" />
            <bitfield mask="0x00F00000" name="PIXEL232" />
            <bitfield mask="0x0F000000" name="PIXEL231" />
            <bitfield mask="0xF0000000" name="PIXEL230" />
         </register>
         <register caption="" name="GLCDCURDATA93" offset="0x974" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL2315" />
            <bitfield mask="0x000000F0" name="PIXEL2314" />
            <bitfield mask="0x00000F00" name="PIXEL2313" />
            <bitfield mask="0x0000F000" name="PIXEL2312" />
            <bitfield mask="0x000F0000" name="PIXEL2311" />
            <bitfield mask="0x00F00000" name="PIXEL2310" />
            <bitfield mask="0x0F000000" name="PIXEL239" />
            <bitfield mask="0xF0000000" name="PIXEL238" />
         </register>
         <register caption="" name="GLCDCURDATA94" offset="0x978" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL2323" />
            <bitfield mask="0x000000F0" name="PIXEL2322" />
            <bitfield mask="0x00000F00" name="PIXEL2321" />
            <bitfield mask="0x0000F000" name="PIXEL2320" />
            <bitfield mask="0x000F0000" name="PIXEL2319" />
            <bitfield mask="0x00F00000" name="PIXEL2318" />
            <bitfield mask="0x0F000000" name="PIXEL2317" />
            <bitfield mask="0xF0000000" name="PIXEL2316" />
         </register>
         <register caption="" name="GLCDCURDATA95" offset="0x97C" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL2331" />
            <bitfield mask="0x000000F0" name="PIXEL2330" />
            <bitfield mask="0x00000F00" name="PIXEL2329" />
            <bitfield mask="0x0000F000" name="PIXEL2328" />
            <bitfield mask="0x000F0000" name="PIXEL2327" />
            <bitfield mask="0x00F00000" name="PIXEL2326" />
            <bitfield mask="0x0F000000" name="PIXEL2325" />
            <bitfield mask="0xF0000000" name="PIXEL2324" />
         </register>
         <register caption="" name="GLCDCURDATA96" offset="0x980" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL247" />
            <bitfield mask="0x000000F0" name="PIXEL246" />
            <bitfield mask="0x00000F00" name="PIXEL245" />
            <bitfield mask="0x0000F000" name="PIXEL244" />
            <bitfield mask="0x000F0000" name="PIXEL243" />
            <bitfield mask="0x00F00000" name="PIXEL242" />
            <bitfield mask="0x0F000000" name="PIXEL241" />
            <bitfield mask="0xF0000000" name="PIXEL240" />
         </register>
         <register caption="" name="GLCDCURDATA97" offset="0x984" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL2415" />
            <bitfield mask="0x000000F0" name="PIXEL2414" />
            <bitfield mask="0x00000F00" name="PIXEL2413" />
            <bitfield mask="0x0000F000" name="PIXEL2412" />
            <bitfield mask="0x000F0000" name="PIXEL2411" />
            <bitfield mask="0x00F00000" name="PIXEL2410" />
            <bitfield mask="0x0F000000" name="PIXEL249" />
            <bitfield mask="0xF0000000" name="PIXEL248" />
         </register>
         <register caption="" name="GLCDCURDATA98" offset="0x988" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL2423" />
            <bitfield mask="0x000000F0" name="PIXEL2422" />
            <bitfield mask="0x00000F00" name="PIXEL2421" />
            <bitfield mask="0x0000F000" name="PIXEL2420" />
            <bitfield mask="0x000F0000" name="PIXEL2419" />
            <bitfield mask="0x00F00000" name="PIXEL2418" />
            <bitfield mask="0x0F000000" name="PIXEL2417" />
            <bitfield mask="0xF0000000" name="PIXEL2416" />
         </register>
         <register caption="" name="GLCDCURDATA99" offset="0x98C" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL2431" />
            <bitfield mask="0x000000F0" name="PIXEL2430" />
            <bitfield mask="0x00000F00" name="PIXEL2429" />
            <bitfield mask="0x0000F000" name="PIXEL2428" />
            <bitfield mask="0x000F0000" name="PIXEL2427" />
            <bitfield mask="0x00F00000" name="PIXEL2426" />
            <bitfield mask="0x0F000000" name="PIXEL2425" />
            <bitfield mask="0xF0000000" name="PIXEL2424" />
         </register>
         <register caption="" name="GLCDCURDATA100" offset="0x990" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL257" />
            <bitfield mask="0x000000F0" name="PIXEL256" />
            <bitfield mask="0x00000F00" name="PIXEL255" />
            <bitfield mask="0x0000F000" name="PIXEL254" />
            <bitfield mask="0x000F0000" name="PIXEL253" />
            <bitfield mask="0x00F00000" name="PIXEL252" />
            <bitfield mask="0x0F000000" name="PIXEL251" />
            <bitfield mask="0xF0000000" name="PIXEL250" />
         </register>
         <register caption="" name="GLCDCURDATA101" offset="0x994" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL2515" />
            <bitfield mask="0x000000F0" name="PIXEL2514" />
            <bitfield mask="0x00000F00" name="PIXEL2513" />
            <bitfield mask="0x0000F000" name="PIXEL2512" />
            <bitfield mask="0x000F0000" name="PIXEL2511" />
            <bitfield mask="0x00F00000" name="PIXEL2510" />
            <bitfield mask="0x0F000000" name="PIXEL259" />
            <bitfield mask="0xF0000000" name="PIXEL258" />
         </register>
